[
    {
        "dateStart": "SEP 2021",
        "dateEnd": "JUN 2023",
        "header": "Web Developer · Dev.Pro",
        "link": "https://dev.pro/",
        "description": "Implemented innovative features for interconnected restaurant service apps, including Point of Sale and Kitchen Screen. Utilized Angular, Vue, and Typescript for streamlined transactions. Optimized frontend and backend legacy code using JavaScript, jQuery, and thorough debugging. Ensured robustness with comprehensive unit and end-to-end tests. Active in team meetings, conducting code reviews and providing valuable insights. Strong reporting skills to update managers on progress and milestones. Translated design with Figma for intuitive interfaces.",
        "skills": ["JavaScript", "TypeScript", "Vue", "Angular2+", "SCSS", "SQL", "Electron", "Cordova", "Figma", "BitBucket"]
    },
    {
        "dateStart": "APR 2020",
        "dateEnd": "SEP 2021",
        "header": "Chief Operating Officer Assistant · Planit Inc.",
        "link": "https://planit-inc.com/",
        "description": "Streamlined VDC projects coordination, managed operations team, and fostered stakeholder relationships. Supported Project Managers, optimizing workflows and resource allocation. Implemented automated tools with Google Sheets, Data Studio, and Apps Script, reducing data collection time and enabling efficient analysis for 150+ employees.",
        "skills": ["Google Sheets", "App Script (JS + Google Sheets API)", "Data Studio", "SQL"]
    },
    {
        "dateStart": "FEB 2019",
        "dateEnd": "SEP 2021",
        "header": "BIM Specialist · Planit Inc.",
        "link": "https://planit-inc.com/",
        "description": "Utilized Autodesk software (Revit, AutoCAD, Civil 3D, Navisworks) to create accurate 3D models and 2D drawings for construction consulting in the USA. Conducted collision analysis, reducing clashes through contractor collaboration. Ensured project communication via RFIs, developed precise Shop Drawings, maintained quality control, and applied 5D estimation for cost-effective project planning.",
        "skills": ["Revit", "Autocad", "BIM 360", "Dynamo (Python)", "Navisworks"]
    }
]
